###############################################################
########################## Chapter 2 ##########################
###############################################################

#--------------------------------------------------------------
# [1] Built-in functions
#--------------------------------------------------------------

print(dir(__builtins__))

# [1] Number-dealing functions
abs() # الموجب موجب والسالب موجب
round() # لتقريب الأرقام
pow('base','exponent','modulus') # باور
max()
min()
sum()

# [2] String-dealing functions:
len()
str()
format()
chr()
ord()

# [3] Types changing functions:
int()
float()
bool()
list()
tuple()
set()
dict()


#--------------------------------------------------------------
# [2] Files handling
#--------------------------------------------------------------

#--------------------------------------------------------------
# [2] Modules
#--------------------------------------------------------------

# To show all 'functions' in a 'module':
print(dir('enter the module here'))
